//  12. На входе n– количество элементов массива, затем пользователь заполняет массив с клавиатуры.
//  Значения могутбытьстрокового иличислового типаданных.Составить двамассива: одинизстрок,
//  другой —изчисел.ИспользоватьметодforEach.
//  Входные: ["apple", 10, "banana", 20, 30, "cherry"] → Результат: ["apple", "banana", "cherry"], [10, 20, 30]
//  Входные: [5, "dog", 7, "cat"] → Результат: ["dog", "cat"], [5, 7]
//  Входные: ["a", "b", "c", 1, 2, 3] → Результат: ["a", "b", "c"], [1, 2, 3]


const arr = ["apple", 10, "banana", 20, 30, "cherry"];
const num = [];
const str = [];
arr.forEach(function (el){
    if(isNaN(el)){
        str.push(el);
    }
    else{
        num.push(el);
    }
})
console.log(num);
console.log(str);

