// 12. Сформируйте массив из 10 значений prompt. Выведите числа из массива, начинающиеся на 1, 2
//  или5.
//  Метод: Используйтециклfor.
//  Входные: [10, 20, 30, 50, 235, 3000] → Результат: [10, 20, 50, 235]
//  Входные: [12, 22, 35, 51, 235, 102] → Результат: [12, 22, 51, 235, 102]
//  Входные: [3, 4, 7, 8, 9] → Результат: []

const arr = [];
for (let i = 1; i < 10; i++) {
    arr.push(prompt());
}

const res = [];
for (let i = 0; i < arr.length; i++) {
    if (arr[i][0] == 1 || arr[i][0] == 2 || arr[i][0] == 5) 
        res.push(arr[i]);
}
console.log(res);
